fio/localhost_read/10_mb_read_quic.log
read_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-30-g46559
Starting 1 process

read_test: (groupid=0, jobs=1): err= 0: pid=552395: Sun Feb 16 17:54:53 2025
  read: IOPS=1863, BW=7453KiB/s (7632kB/s)(10.0MiB/1374msec)
    clat (usec): min=179, max=8632, avg=532.32, stdev=394.98
     lat (usec): min=179, max=8634, avg=532.66, stdev=395.17
    clat percentiles (usec):
     |  1.00th=[  221],  5.00th=[  265], 10.00th=[  297], 20.00th=[  338],
     | 30.00th=[  371], 40.00th=[  404], 50.00th=[  441], 60.00th=[  474],
     | 70.00th=[  529], 80.00th=[  611], 90.00th=[  816], 95.00th=[ 1139],
     | 99.00th=[ 2114], 99.50th=[ 2573], 99.90th=[ 4080], 99.95th=[ 6652],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 7281, max= 7936, per=100.00%, avg=7608.50, stdev=463.15, samples=2
   iops        : min= 1820, max= 1984, avg=1902.00, stdev=115.97, samples=2
  lat (usec)   : 250=3.32%, 500=62.50%, 750=21.91%, 1000=6.02%
  lat (msec)   : 2=5.16%, 4=0.94%, 10=0.16%
  cpu          : usr=0.87%, sys=2.40%, ctx=2666, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=7453KiB/s (7632kB/s), 7453KiB/s-7453KiB/s (7632kB/s-7632kB/s), io=10.0MiB (10.5MB), run=1374-1374msec