fio/localhost_read/10_mb_read_tcp.log
read_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-30-g46559
Starting 1 process
read_test: Laying out IO file (1 file / 10MiB)

read_test: (groupid=0, jobs=1): err= 0: pid=548376: Sun Feb 16 17:52:45 2025
  read: IOPS=2723, BW=10.6MiB/s (11.2MB/s)(10.0MiB/940msec)
    clat (usec): min=103, max=6130, avg=364.20, stdev=341.69
     lat (usec): min=103, max=6131, avg=364.44, stdev=341.77
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  192], 10.00th=[  208], 20.00th=[  227],
     | 30.00th=[  241], 40.00th=[  260], 50.00th=[  281], 60.00th=[  306],
     | 70.00th=[  343], 80.00th=[  400], 90.00th=[  537], 95.00th=[  766],
     | 99.00th=[ 1827], 99.50th=[ 2442], 99.90th=[ 4817], 99.95th=[ 5276],
     | 99.99th=[ 6128]
   bw (  KiB/s): min=11344, max=11344, per=100.00%, avg=11344.00, stdev= 0.00, samples=1
   iops        : min= 2836, max= 2836, avg=2836.00, stdev= 0.00, samples=1
  lat (usec)   : 250=34.77%, 500=53.63%, 750=6.33%, 1000=2.03%
  lat (msec)   : 2=2.46%, 4=0.62%, 10=0.16%
  cpu          : usr=1.06%, sys=2.56%, ctx=2668, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=10.6MiB/s (11.2MB/s), 10.6MiB/s-10.6MiB/s (11.2MB/s-11.2MB/s), io=10.0MiB (10.5MB), run=940-940msec